defmodule MmCalendar.Language.Translator do
  @languages MmCalendar.Language.get_supported_languages()
  @lang_count Enum.count(@languages)

  @strings %{
    "0" => ["0", "၀", "၀", "0", "၀"],
    "1" => ["1", "၁", "၁", "1", "၁"],
    "2" => ["2", "၂", "၂", "2", "၂"],
    "3" => ["3", "၃", "၃", "3", "၃"],
    "4" => ["4", "၄", "၄", "4", "၄"],
    "5" => ["5", "၅", "၅", "5", "၅"],
    "6" => ["6", "၆", "၆", "6", "၆"],
    "7" => ["7", "၇", "၇", "7", "၇"],
    "8" => ["8", "၈", "၈", "8", "၈"],
    "9" => ["9", "၉", "၉", "9", "၉"],
    mm_year: ["Myanmar Year", "မြန်မာနှစ်", "သက္ကရာဇ်ဍုၚ်", "ပီ​​ၵေႃးၸႃႇ", "ကီၢ်ပယီၤ"],
    good_friday: ["Good Friday", "သောကြာနေ့ကြီး", "သောကြာနေ့ကြီး", "ဢၼ်လီဝၼ်းသုၵ်", "မုၢ်ဖီဖး"],
    new_year: ["New Year's", "နှစ်ဆန်း", "လှာဲသၞာံ", "ပီမႂ်ႇ", "နှစ်ဆန်း"],
    independence: ["Independence", "လွတ်လပ်ရေး", "သၠးပွး", "ဢၼ်လွတ်ႈလႅဝ်", "လွတ်လပ်ရေး"],
    union: ["Union", "ပြည်ထောင်စု", "ကၟိန်ဍုၚ်", "ၸိုင်ႈမိူင်းႁူမ်ႈတုမ်ႊ", "ပြည်ထောင်စု"],
    peasants: ["Peasants'", "တောင်သူလယ်သမား", "သၟာဗ္ၚ", "ၸဝ်ႈႁႆႈၸဝ်ႈၼႃး", "တောင်သူလယ်သမား"],
    resistance: ["Resistance", "တော်လှန်ရေး", "ပၠန်ဂတးဗၟာ", "လွင်ႈလုၵ်ႉၽိုၼ်", "တော်လှန်ရေး"],
    labour: ["Labour", "အလုပ်သမား", "သၟာကမၠောန်", "ၵူၼ်းႁဵတ်းၵၢၼ်", "အလုပ်သမား"],
    martyrs: ["Martyrs'", "အာဇာနည်", "အာဇာနဲ", "ၽူႈႁတ်းငၢၼ်", "အာဇာနည်"],
    christmas: ["Christmas", "ခရစ္စမတ်", "ခရေဿမာတ်", "ပွႆးၶရိတ်ႉသမတ်ႉၸ်", "ခရံာ်အိၣ်ဖျဲၣ်မူးပွဲန့ၣ်"],
    buddha: ["Buddha", "ဗုဒ္ဓ", "သ္ဘၚ်ဖဍာ်ဇြဲ", "ပုတ်ႉထ", "ဗုဒ္ဓ"],
    buddhist_lent_start: [
      "Start of Buddhist Lent",
      "ဓမ္မစကြာနေ့",
      "တ္ၚဲတွံဓဝ်ဓမ္မစက်",    "ဓမ္မစကြာနေ့", "ဓမ္မစကြာနေ့"],
         
  

    buddhist_lent_end: ["End of Buddhist Lent", "မီးထွန်းပွဲ", "တ္ၚဲအဘိဓရ်", "ပွႆတႆႈၾႆး", "မီးထွန်းပွဲ"],
    tazaungdaing: ["Tazaungdaing", "တန်ဆောင်တိုင်", "သ္ဘၚ်ပူဇဴပၟတ်ပၞာၚ်", "တန်ဆောင်တိုင်", "တန်ဆောင်တိုင်"],
    national: ["National", "အမျိုးသား", "ကောန်ဂကူဗၟာ", "ၵူၼ်းမိူင်", "အမျိုးသား"],
    karen: ["Karen", "ကရင်", "ကရေၚ်", "ယၢင်းၽိူၵ်ႇ", "ကရင်"],
    pwe: ["Pwe", "ပွဲ", "သ္ဘၚ်", "ပွႆ", "ပွဲ"],
    thingyan: ["Thingyan", "သင်္ကြန်", "အတး", "သၢင်းၵျၢၼ်ႇ", "သင်္ကြန်"],
    akyo: ["Akyo", "အကြို", "ဒစး", "အကြို", "ႁပ်ႉ"],
    akyat: ["Akyat", "အကြတ်", "ကြာပ်", "ၵျၢပ်ႈ", "အကြတ်"],
    akya: ["Akya", "အကျ", "စှေ်", "တူၵ်း", "အကျ"],
    atat: ["Atat", "အတက်", "တိုန်", "ၶိုၼ်ႈ", "အတက်"],
    amyeittasote: ["Amyeittasote", "အမြိတ္တစုတ်", "ကိုန်အမြိုတ်", "အမြိတ္တစုတ်", "အမြိတ္တစုတ်"],
    warameittugyi: ["Warameittugyi", "ဝါရမိတ္တုကြီး", "ကိုန်ဝါရမိတ္တုဇၞော်", "ဝါရမိတ္တုကြီး", "ဝါရမိတ္တုကြီး"],
    warameittunge: ["Warameittunge", "ဝါရမိတ္တုငယ်", "ကိုန်ဝါရမိတ္တုဍောတ်", "ဝါရမိတ္တုငယ်", "ဝါရမိတ္တုငယ်"],
    thamaphyu: ["Thamaphyu", "သမားဖြူ", "ကိုန်လေၚ်ဒိုက်", "သမားဖြူ", "သမားဖြူ"],
    thamanyo: ["Thamanyo", "သမားညို", "ကိုန်ဟုံဗြမ်", "သမားညို", "သမားညို"],
    yatpote: ["Yatpote", "ရက်ပုပ်", "ကိုန်လီုလာ်", "ရက်ပုပ်", "ရက်ပုပ်"],
    yatyotema: ["Yatyotema", "ရက်ယုတ်မာ", "ကိုန်ယုတ်မာ", "ရက်ယုတ်မာ", "ရက်ယုတ်မာ"],
    mahayatkyan: ["Mahayatkyan", "မဟာရက်ကြမ်း", "ကိုန်ဟွံခိုဟ်", "မဟာရက်ကြမ်း", "မဟာရက်ကြမ်း"],
    nagapor: ["Nagapor", "နဂါးပေါ်", "နာ်မံက်", "နဂါးပေါ်", "နဂါးပေါ်"],
    shanyat: ["Shanyat", "ရှမ်းရက်", "တ္ၚဲဒတန်", "ရှမ်းရက်", "ရှမ်းရက်"],
    mon: ["'Mon'", "မွန်", "ပၠန်", "မွၼ်း", "မွန်"],
    aung_san_bd: [
      "G. Aung San BD",
      "ဗိုလ်ချုပ်မွေးနေ့","တ္ၚဲသၟိၚ်ဗၟာ အံၚ်သာန်ဒှ်မၞိဟ်", "ဝၼ်းၵိူတ်ၸွမ်သိုၵ်",     

      
      "ဗိုလ်ချုပ်မွေးနေ့"],
    
    valentines: ["Valentines", "ချစ်သူများ", "ဝုတ်ဗၠာဲ", "ၵေႃႈႁၵ်ႉ", "ချစ်သူများ"],
    earth: ["Earth", "ကမ္ဘာမြေ", "ဂၠးကဝ်", "လိၼ်မိူင်း", "ကမ္ဘာမြေ"],
    april_fools: ["April Fools'", "ဧပြီအရူး","သ္ပပရအ်", "ဢေႇပရႄႇၵူၼ်းယွ          င်ႇ", "အ့ဖြ့ၣ် fool"],
    red_cross: ["Red Cross", "ကြက်ခြေနီ", "ဇိုၚ်ခ္ဍာ်ဍာဲ", "ဢၼ်မီးသီလႅင်ႁၢင်ႈၶႂၢႆႇၶႃပေ", "ကြက်ခြေနီ"],
    united_nations: [
      "United Nations",
      "ကုလသမ္မဂ္ဂ", "ကုလသမ္မဂ္ဂ",     

      "     ဢၼ်ၽွမ်ႉႁူမ်ႈၸိူဝ်ႉၶိူဝ်းၼမ်", "ကုလသမ္မဂ္ဂ     























"
    ],
    halloween: ["Halloween", "သရဲနေ့","ဟေဝ်လဝ်ဝိန်", "ဝၼ်းၽဵ          တ်", "သရဲနေ့"],
    shan: ["Shan", "ရှမ်း", "သေံ", "တႆး", "ရှမ်း"],
    mothers: ["Mothers'", "အမေများ", "မိအံက်", "မႄႈ", "မိၢ်အ"],
    fathers: ["Fathers'", "အဖေများ", "မအံက်", "ပေႃ", "ပၢ်အ"],
    sasana_year: ["Sasana Year", "သာသနာနှစ်", "သက္ကရာဇ်သာသနာ", "ပီသႃႇသၼႃႇ", "နံၣ်သာသနာ"],
    eid: ["Eid", "အိဒ်", "အိဒ်", "အိဒ်", "အိဒ်"],
    diwali: ["Diwali", "ဒီဝါလီ", "ဒီဝါလီ", "ဒီဝါလီ", "ဒီဝါလီ"],
    nahathamaya: ["Mahathamaya", "မဟာသမယ", "မဟာသမယ", "ဢၼ်ယႂ်ႇၽွမ်ႉႁူမ်ႈ", "မဟာသမယ"],
    garudhamma: ["Garudhamma", "ဂရုဓမ္မ", "ဂရုဓမ္မ", "ဂရုဓမ္မ", "ဂရုဓမ္မ"],
    metta: ["Metta", "မေတ္တာ", "မေတ္တာ", "မႅတ်ႉတႃႇ", "မေတ္တာ"],
    taungpyone: ["Taungpyone", "တောင်ပြုန်း", "တောင်ပြုန်း", "တောင်ပြုန်း", "တောင်ပြုန်း"],
    yadanagu: ["Yadanagu", "ရတနာ့ဂူ", "ရတနာ့ဂူ", "ရတနာ့ဂူ", "ရတနာ့ဂူ"],
    authors: ["Authors'", "စာဆိုတော်", "စာဆိုတော်", "ၽူႈတႅမ်ႈၽႅၼ်", "စာဆိုတော်"],
    world: ["World", "ကမ္ဘာ့", "ကမ္ဘာ့", "လူၵ်", "ကမ္ဘာ့"],
    teachers: ["Teachers'", "ဆရာများ", "ဆရာများ", "ၶူးသွၼ်", "ဆရာများ"],
    holiday: ["Holiday", "ရုံးပိတ်ရက်", "ရုံးပိတ်ရက်", "ဝၼ်းပိၵ်ႉလုမ်း", "ရုံးပိတ်ရက်"],
    chinese: ["Chinese", "တရုတ်", "တရုတ်", "ၵူၼ်းၸၢဝ်းၶေ", "တရုတ်"],
    easter: ["Easter", "ထမြောက်ရာနေ့", "ထမြောက်ရာနေ့", "ပၢင်ႇပွႆးၶွပ်ႈၶူပ်ႇၸဝ်ႈၶရိတ်", "ထမြောက်ရာနေ့"],
    sunday: ["Sunday", "တနင်္ဂနွေနေ့", "တ္ၚဲအဒိုတ်တ္ၚဲ", "ဝၼ်းဢႃးတိတ်ႉဝၼ်း", "မုၢ်ဒဲးနံၤ"],
    monday: ["Monday", "တနင်္လာနေ့", "တ္ၚဲစန်တ္ၚဲ", "ဝၼ်းၸၼ်ဝၼ်း", "မုၢ်ဆၣ်နံၤ"],
    tuesday: ["Tuesday", "အင်္ဂါနေ့", "တ္ၚဲအင္ၚာတ္ၚဲ", "ဝၼ်းဢၢင်းၵၢၼ်းဝၼ်း", "မုၢ်ယူာ်နံၤ"],
    wednesday: ["Wednesday", "ဗုဒ္ဓဟူးနေ့", "တ္ၚဲဗုဒ္ဓဝါတ္ၚဲ", "ဝၼ်းပုတ်ႉဝၼ်း", "မုၢ်ပျဲၤနံၤ"],
    thursday: ["Thursday", "ကြာသပတေးနေ့", "တ္ၚဲဗြဴဗတိတ္ၚဲ", "ဝၼ်းၽတ်းဝၼ်း", "မုၢ်လ့ၤဧိၤနံၤ"],
    friday: ["Friday", "သောကြာနေ့", "တ္ၚဲသိုက်တ္ၚဲ", "ဝၼ်းသုၵ်းဝၼ်း", "မုၢ်ဖီဖးနံၤ"],
    saturday: ["Saturday", "စနေနေ့", "တ္ၚဲသ္ၚိသဝ်တ္ၚဲ", "ဝၼ်းသဝ်ဝၼ်း", "မုၢ်ဘူၣ်နံၤ"],
    sabbath_eve: ["Sabbath Eve", "အဖိတ်", "တ္ၚဲတိၚ်", "ၽိတ်ႈ", "အဖိတ်"],
    sabbath: ["Sabbath", "ဥပုသ်", "တ္ၚဲသဳ", "သိၼ်", "အိၣ်ဘှံး"],
    yatyaza: ["Yatyaza", "ရက်ရာဇာ", "တ္ၚဲရာဇာ", "ဝၼ်းထုၼ်း", "ရက်ရာဇာ"],
    pyathada: ["Pyathada", "ပြဿဒါး", "တ္ၚဲပြာဗ္ဗဒါ", "ဝၼ်းပျၢတ်ႈ", "ပြဿဒါး"],
    afternoon_pyathada: ["Afternoon Pyathada", "မွန်းလွဲပြဿဒါး", "တ္ၚဲပြာဗ္ဗဒါ", "ဝၼ်းပျၢတ်ႈ", "မွန်းလွဲပြဿဒါး"],
    afternoon: ["Afternoon", "မွန်းလွဲ", "မွန်းလွဲ", "ဝၢႆးဝၼ်း", "မွန်းလွဲ"],
    january: ["January", "ဇန်နဝါရီ", "ဂျာန်နျူအာရဳ", "ၸၼ်ႇဝႃႇရီႇ", "ယနူၤအါရံၤ"],
    febuary: ["February", "ဖေဖော်ဝါရီ", "ဝှေဝ်ဗျူအာရဳ", "ၾႅပ်ႉဝႃႇရီႇ", "ဖ့ၤဘြူၤအါရံၤ"],
    march: ["March", "မတ်", "မာတ်ချ်", "မျၢတ်ႉၶျ်", "မၢ်ၡး"],
    april: ["April", "ဧပြီ", "ဨပြေယ်လ်", "ဢေႇပရႄႇ", "အ့ဖြ့ၣ်"],
    may: ["May", "မေ", "မေ", "မေ", "မ့ၤ"],
    june: ["June", "ဇွန်", "ဂျုန်", "ၵျုၼ်ႇ", "ယူၤ"],
    july: ["July", "ဇူလိုင်", "ဂျူလာၚ်", "ၵျူႇလၢႆႇ", "ယူၤလံ"],
    august: ["August", "ဩဂုတ်", "အဝ်ဂါတ်", "ဢေႃးၵၢတ်ႉ", "အီကူး"],
    september: ["September", "စက်တင်ဘာ", "သိတ်ထီဗာ", "သႅပ်ႇထႅမ်ႇပႃႇ", "စဲးပတ့ဘၢၣ်"],
    october: ["October", "အောက်တိုဘာ", "အံက်ထဝ်ဗာ", "ဢွၵ်ႇထူဝ်ႇပႃႇ", "အီးကထိဘၢၣ်"],
    november: ["November", "နိုဝင်ဘာ", "နဝ်ဝါမ်ဗာ", "ၼူဝ်ႇဝႅမ်ႇပႃႇ", "နိၣ်ဝ့ဘၢၣ်"],
    december: ["December", "ဒီဇင်ဘာ", "ဒီဇြေန်ဗာ", "တီႇသႅမ်ႇပႃႇ", "ဒံၣ်စ့ဘၢၣ်"],
    tagu: ["Tagu", "တန်ခူး", "ဂိတုစဲ", "ႁႃႈ", "လါချံ"],
    kason: ["Kason", "ကဆုန်", "ဂိတုပသာ်", "ႁူၵ်း", "ဒ့ၣ်ညါ"],
    nayon: ["Nayon", "နယုန်", "ဂိတုဇှေ်", "ၸဵတ်း", "လါနွံ"],
    waso: ["Waso", "ဝါဆို", "ဝါဆို", "ပႅတ်ႇ", "လါဃိး"],
    wagaung: ["Wagaung", "ဝါခေါင်", "ဂိတုခ္ဍဲသဳ", "ၵဝ်ႈ", "လါခူး"],
    tawthalin: ["Tawthalin", "တော်သလင်း", "ဂိတုဘတ်", "သိပ်း", "ဆံးမုၢ်"],
    thadingyut: ["Thadingyut", "သီတင်းကျွတ်", "ဂိတုဝှ်", "သိပ်းဢဵတ်း", "ဆံးဆၣ်"],
    tazaungmon: ["Tazaungmon", "တန်ဆောင်မုန်း", "ဂိတုက္ထိုန်", "သိပ်းသွင်", "လါနီ"],
    nadaw: ["Nadaw", "နတ်တော်", "ဂိတုမြေက္ကသဵု", "ၸဵင်", "လါပျုၤ"],
    pyatho: ["Pyatho", "ပြာသို", "ဂိတုပှော်", "ၵမ်", "သလ့ၤ"],
    tabodwe: ["Tabodwe", "တပို့တွဲ", "ဂိတုမာ်", "သၢမ်", "ထ့ကူး"],
    tabaung: ["Tabaung", "တပေါင်း", "ဂိတုဖဝ်ရဂိုန်", "သီႇ", "သွ့ကီ"],
    first: ["First", "ပ", "ပ", "ပ", "၁ "],
    second: ["Second", "ဒု", "ဒု", "တု", "၂ "],
    late: ["Late", "နှောင်း", "နှောင်း", "ဝၢႆး", "စဲၤ"],
    waxing: ["Waxing", "လဆန်း", "မံက်", "လိူၼ်မႂ်ႇ", "လါထီၣ်"],
    waning: ["Waning", "လဆုတ်", "စွေက်", "လိူၼ်လွင်ႈ", "လါလီၤ"],
    full_moon: ["Full Moon", "လပြည့်", "ပေၚ်", "လိူၼ်မူၼ်း", "လါပှဲၤ"],
    new_moon: ["New Moon", "လကွယ်", "အိုတ်", "လိူၼ်လပ်း", "လါဘၢ"],
    nay: ["Nay", "နေ့", "တ္ၚဲ", "ဝၼ်း", "နံၤ"],
    day: ["Day", "နေ့", "တ္ၚဲ", "ဝၼ်း", "နံၤ"],
    yat: ["Yat", "ရက်", "ရက်", "ဝၼ်း", "ရက်"],
    year: ["Year", "နှစ်", "နှစ်", "ပီ", "နံၣ်"],
    ku: ["Ku", "ခု", "သၞာံ", "ၶု", ""],
    naga: ["Naga", "နဂါး", "နဂါး", "ႁူဝ်", "နဂါး"],
    head: ["Head", "ခေါင်း", "ခေါင်း", "ၼၵႃး", "ခေါင်း"],
    facing: ["Facing", "လှည့်", "လှည့်", "ဝၢႆႇ", "လှည့်"],
    east: ["East", "အရှေ့", "အရှေ့", "တၢင်းဢွၵ်ႇ", "အရှေ့"],
    west: ["West", "အနောက်", "အနောက်", "တၢင်းတူၵ်း", "အနောက်"],
    south: ["South", "တောင်", "တောင်", "တၢင်းၸၢၼ်း", "တောင်"],
    north: ["North", "မြောက်", "မြောက်", "တၢင်းႁွင်ႇ", "မြောက်"],
    mahabote: ["Mahabote", "မဟာဘုတ်", "မဟာဘုတ်", "မဟာဘုတ်", "မဟာဘုတ်"],
    born: ["Born", "ဖွား", "ဖွား", "ဢၼ်မီးပႃႇရမီ", "ဖွား"],
    binga: ["Binga", "ဘင်္ဂ", "ဘင်္ဂ", "ဘင်္ဂ", "ဘင်္ဂ"],
    atun: ["Atun", "အထွန်း", "အထွန်း", "အထွန်း", "အထွန်း"],
    yaza: ["Yaza", "ရာဇ", "ရာဇ", "ရာဇ", "ရာဇ"],
    adipati: ["Adipati", "အဓိပတိ", "အဓိပတိ", "အဓိပတိ", "အဓိပတိ"],
    marana: ["Marana", "မရဏ", "မရဏ", "မရဏ", "မရဏ"],
    thike: ["Thike", "သိုက်", "သိုက်", "သိုက်", "သိုက်"],
    puti: ["Puti", "ပုတိ", "ပုတိ", "ပုတိ", "ပုတိ"],
    ogre: ["Ogre", "ဘီလူး", "ဘီလူး", "ၽီလူ", "ဘီလူး"],
    elf: ["Elf", "နတ်", "နတ်", "ၽီမႅၼ်းဢွၼ်", "နတ်"],
    human: ["Human", "လူ", "လူ", "ဢၼ်ပဵၼ်ၵူၼ်", "လူ"],
    nakhat: ["Nakhat", "နက္ခတ်", "နက္ခတ်", "လႅင်ႊလၢဝ်", "နက္ခတ်"],
    hpusha: ["Hpusha", "ပုဿ", "ပုဿ", "ပုဿ", "ပုဿ"],
    magha: ["Magha", "မာခ", "မာခ", "မာခ", "မာခ"],
    phalguni: ["Phalguni", "ဖ္လကိုန်", "ဖ္လကိုန်", "ဖ္လကိုန်", "ဖ္လကိုန်"],
    chitra: ["Chitra", "စယ်", "စယ်", "စယ်", "စယ်"],
    visakha: ["Visakha", "ပိသျက်", "ပိသျက်", "ပိသျက်", "ပိသျက်"],
    jyeshtha: ["Jyeshtha", "စိဿ", "စိဿ", "စိဿ", "စိဿ"],
    ashadha: ["Ashadha", "အာသတ်", "အာသတ်", "အာသတ်", "အာသတ်"],
    sravana: ["Sravana", "သရဝန်", "သရဝန်", "သရဝန်", "သရဝန်"],
    bhadrapaha: ["Bhadrapaha", "ဘဒြ", "ဘဒြ", "ဘဒြ", "ဘဒြ"],
    asvini: ["Asvini", "အာသိန်", "အာသိန်", "အာသိန်", "အာသိန်"],
    krittika: ["Krittika", "ကြတိုက်", "ကြတိုက်", "ကြတိုက်", "ကြတိုက်"],
    mrigasiras: ["Mrigasiras", "မြိက္ကသိုဝ်", "မြိက္ကသိုဝ်", "မြိက္ကသိုဝ်", "မြိက္ကသိုဝ်"],
    calculator: ["Calculator", "တွက်စက်", "တွက်စက်", "သွၼ်", "တွက်စက်"],
    common: ["Common", "ရိုးရိုးနှစ်", "ရိုးရိုးနှစ်", "ရိုးရိုးနှစ်"],
    little_watat: ["Little Watat", "ဝါထပ်နှစ်", "ဝါထပ်နှစ်", "ဝါထပ်နှစ်"],
    big_watat: ["Big Watat", "ဝါကြီးထပ်နှစ်", "ဝါကြီးထပ်နှစ်", "ဝါကြီးထပ်နှစ်"],
    first_waso: ["First Waso", "ပ-ဝါဆို", "ပ-ဝါဆို", "ပ-ဝါဆို", "ပ-ဝါဆို"],
    late_tagu: ["Late Tagu", "နှောင်းတန်ခူး", "နှောင်းတန်ခူး", "နှောင်းတန်ခူး", "နှောင်းတန်ခူး"],
    late_kason: ["Late Kason", "နှောင်းကဆုန်", "နှောင်းကဆုန်", "နှောင်းကဆုန်", "နှောင်းကဆုန်"],
    separator: [",", "၊", "၊", "၊", "၊"]
    # [". ","။ ","။ ","။ ","။ ","။ "],
    # [", ","၊ ","၊ ","၊ ","၊ ","၊ "],
  }

  def translate(str, lang_index)
      when is_integer(lang_index) and lang_index >= 0 and lang_index <= @lang_count do
    translate_name(str, lang_index)
  end

  def translate(str, language) when is_atom(language) and language in @languages do
    lang_index = Enum.find_index(@languages, fn lang_name -> lang_name == language end)
    translate_name(str, lang_index)
  end

  defp translate_name(str, lang_index) do
    if Map.has_key?(@strings, str) do
      Map.get(@strings, str)
      |> Enum.at(lang_index)
    else
      str
    end
  end
end
